Repository: sayendra99/CLI-AI-ASSISTANT
Catalog: locales/*/LC_MESSAGES/rocket.po
Languages: hi, ro, ta, te

source: Hello, World!
hi: नमस्ते, दुनिया!
ro: Salut, Lume!
ta: வணக்கம், உலகம்!
te: హలో, ప్రపంచం!

source: Welcome to Rocket CLI
hi: रॉकेट CLI में आपका स्वागत है
ro: Bun venit la Rocket CLI
ta: ராக்கெட் CLI-க்கு வரவேற்கிறோம்
te: రాకెట్ CLI కి స్వాగతం

source: Error
hi: त्रुटि
ro: Eroare
ta: பிழை
te: లోపం

source: Success
hi: सफलता
ro: Succes
ta: வெற்றி
te: విజయం

source: Warning
hi: चेतावनी
ro: Avertisment
ta: எச்சரிக்கை
te: హెచ్చరిక

source: Chat with Rocket AI Assistant for coding solutions.
hi: कोडिंग समाधान के लिए रॉकेट AI सहायक के साथ चैट करें।
ro: Discută cu Asistentul AI Rocket pentru soluții de programare.
ta: குறியீட்டு தீர்வுகளுக்கு ராக்கெட் AI உதவியாளருடன் அரட்டை அடியுங்கள்.
te: కోడింగ్ పరిష్కారాల కోసం రాకెట్ AI అసిస్టెంట్‌తో చాట్ చేయండి.

source: Generate code snippets using Rocket AI Assistant.
hi: रॉकेट AI सहायक का उपयोग करके कोड स्निपेट उत्पन्न करें।
ro: Generează fragmente de cod folosind Asistentul AI Rocket.
ta: ராக்கெட் AI உதவியாளரைப் பயன்படுத்தி குறியீடு துணுக்குகளை உருவாக்கவும்.
te: రాకెట్ AI అసిస్టెంట్ ఉపయోగించి కోడ్ స్నిప్పెట్‌లను రూపొందించండి.

source: Explain code from a file or snippet.
hi: फ़ाइल या स्निपेट से कोड की व्याख्या करें।
ro: Explică codul dintr-un fișier sau fragment.
ta: கோப்பு அல்லது துணுக்கிலிருந்து குறியீட்டை விளக்கவும்.
te: ఫైల్ లేదా స్నిప్పెట్ నుండి కోడ్‌ను వివరించండి.

source: Debug errors and issues in your code.
hi: अपने कोड में त्रुटियों और समस्याओं को डीबग करें।
ro: Depanează erori și probleme în codul tău.
ta: உங்கள் குறியீட்டில் பிழைகள் மற்றும் சிக்கல்களைத் திருத்தவும்.
te: మీ కోడ్‌లో లోపాలను మరియు సమస్యలను డీబగ్ చేయండి.

source: Optimize code for performance, readability, or security.
hi: प्रदर्शन, पठनीयता, या सुरक्षा के लिए कोड को अनुकूलित करें।
ro: Optimizează codul pentru performanță, lizibilitate sau securitate.
ta: செயல்திறன், படிக்கும் தன்மை அல்லது பாதுகாப்புக்கு குறியீட்டை மேம்படுத்தவும்.
te: పనితీరు, చదవడానికి సులభత లేదా భద్రత కోసం కోడ్‌ను ఆప్టిమైజ్ చేయండి.

source: Loading configuration...
hi: कॉन्फ़िगरेशन लोड हो रहा है...
ro: Se încarcă configurația...
ta: உள்ளமைவு ஏற்றப்படுகிறது...
te: కాన్ఫిగరేషన్ లోడ్ అవుతోంది...

source: File not found
hi: फ़ाइल नहीं मिली
ro: Fișier negăsit
ta: கோப்பு கிடைக்கவில்லை
te: ఫైల్ కనుగొనబడలేదు

source: Invalid input
hi: अमान्य इनपुट
ro: Intrare invalidă
ta: தவறான உள்ளீடு
te: చెల్లని ఇన్‌పుట్

source: Operation completed successfully
hi: ऑपरेशन सफलतापूर्वक पूरा हुआ
ro: Operațiune finalizată cu succes
ta: செயல்பாடு வெற்றிகரமாக முடிந்தது
te: ఆపరేషన్ విజయవంతంగా పూర్తయింది

source: Authentication required
hi: प्रमाणीकरण आवश्यक
ro: Autentificare necesară
ta: அங்கீகாரம் தேவை
te: ప్రమాణీకరణ అవసరం

source: Logged in successfully
hi: सफलतापूर्वक लॉग इन किया गया
ro: Autentificare reușită
ta: வெற்றிகரமாக உள்நுழைந்தீர்கள்
te: విజయవంతంగా లాగిన్ అయ్యారు

source: Logged out successfully
hi: सफलतापूर्वक लॉग आउट किया गया
ro: Deconectare reușită
ta: வெற்றிகரமாக வெளியேறினீர்கள்
te: విజయవంతంగా లాగౌట్ అయ్యారు

source: Reading file: {filename}
hi: फ़ाइल पढ़ी जा रही है: {filename}
ro: Se citește fișierul: {filename}
ta: கோப்பு படிக்கப்படுகிறது: {filename}
te: ఫైల్ చదవబడుతోంది: {filename}

source: Writing file: {filename}
hi: फ़ाइल लिखी जा रही है: {filename}
ro: Se scrie fișierul: {filename}
ta: கோப்பு எழுதப்படுகிறது: {filename}
te: ఫైల్ వ్రాయబడుతోంది: {filename}

source: File saved successfully
hi: फ़ाइल सफलतापूर्वक सहेजी गई
ro: Fișier salvat cu succes
ta: கோப்பு வெற்றிகரமாக சேமிக்கப்பட்டது
te: ఫైల్ విజయవంతంగా సేవ్ చేయబడింది

source: Connection error
hi: कनेक्शन त्रुटि
ro: Eroare de conexiune
ta: இணைப்புப் பிழை
te: కనెక్షన్ లోపం

source: Rate limit exceeded
hi: दर सीमा पार हो गई
ro: Limită de frecvență depășită
ta: வீத வரம்பு மீறப்பட்டது
te: రేటు పరిమితి మించిపోయింది

source: Invalid API key
hi: अमान्य API कुंजी
ro: Cheie API invalidă
ta: தவறான API விசை
te: చెల్లని API కీ

source: Timeout error
hi: समय समाप्त त्रुटि
ro: Eroare de timeout
ta: நேர முடிவு பிழை
te: టైమౌట్ లోపం

source: Checking provider status...
hi: प्रदाता की स्थिति जाँची जा रही है...
ro: Se verifică starea furnizorului...
ta: வழங்குநர் நிலை சரிபார்க்கப்படுகிறது...
te: ప్రొవైడర్ స్థితి తనిఖీ చేయబడుతోంది...

source: All systems operational
hi: सभी सिस्टम संचालित हैं
ro: Toate sistemele sunt operaționale
ta: அனைத்து அமைப்புகளும் செயல்படுகின்றன
te: అన్ని సిస్టమ్‌లు పనిచేస్తున్నాయి

source: Provider unavailable
hi: प्रदाता अनुपलब्ध
ro: Furnizor indisponibil
ta: வழங்குநர் கிடைக்கவில்லை
te: ప్రొవైడర్ అందుబాటులో లేదు
